/**
 * All About API :::
 * 
 * Api holo emon ekta maddhom jeita dhara client side theke request niye server side aa pathay , and server side theke sei request onojai 
 * data collect kore different different database theke . and sei data ke ghosa maja kore fresh data API er maddhome Provide kore client side aa . 
 * 
 * 
 * 🟩 API বুঝার সবচেয়ে সহজ উদাহরণ
🎯 রেস্টুরেন্ট উদাহরণ

তুমি রেস্টুরেন্টে গিয়ে খাবার অর্ডার দাও

ওয়েটার তোমার অর্ডার কিচেনে পাঠায়

কিচেন খাবার তৈরি করে

ওয়েটার খাবার এনে তোমাকে দেয়

এখানে:

তুমি = Client (যে অনুরোধ পাঠায়)

কিচেন = Server (যেখানে ডেটা থাকে / কাজ হয়)

ওয়েটার = API

🟢 API তোমার অনুরোধ সার্ভারে পাঠায়
🟢 এবং সার্ভার থেকে রেসপন্স এনে তোমাকে দেয়

 */